# 4. Вивести на консоль своє ім'я, намальоване 'зірочками'
#
#   *      *       *        *      * *********
#
#   **     *      * *       **    ** *
#
#   * *    *     *  *      * *  * * *
#
#   * *   *    *    *     * * * * *******
#
#   *  *  *   *      *    *  *  * *
#
#   *   * *  ***********   *      * *
#
#   *    * * *          *  *      * *
#
#   *     ** *            * *      * *
#
#   *      * *             * *      * **********
#
#   * Дод. Виведення арт-ascii тексту модулем art (pip install art). Прочитати можна в репозиторії PyPi – search – art.

from art import *

name_art = text2art("Vadym", font='starwars')
print(name_art)
