# 6. Ввести з клавіатури два цілих числа: x та y
#
#   - Вивести на екран консолі обидва числа, використовуючи тільки один виклик print()
#   - Обчислити суму чисел
#   - Виконати цілий поділ
#   - Знайти решту
#   - Обчислити ступінь числа: x^y

x = int(input("ціле число x: "))
y = int(input("ціле число y: "))

print("x и y:", x, y)

сума = x + y
print('Сума чисел:', сума)

поділ = x // y
print('Поділ:', поділ)

решта = x % y
print('Решта:', решта)

ступінь = x ** y
print('Ступінь числа:', ступінь)